import random
group1 = ["Иванов", "Петров", "Кошкина", "Козлов", "Попов", "Смирнова", "Сидоров", "Котов", "Кузнецов", "Соколова"]
group2 = ["Пискунова", "Киреева", "Киселева", "Емельянова", "Байол", "Яковлева", "Овчинникова", "Чугунова", "Столярова", "Муравьева"]
team = (random.sample(group1, 5)) + (random.sample(group2, 5))
s_team = sorted(team)
print (f'{group1}\n{group2}\n{team}\nДлина кортежа: {len(team)}\n{s_team}\nВходит ли "Иванов":{"Иванов" in team}\nКоличество вхождений:{team.count("Иванов")}')
